
topic_order = [
        'ארץ',
        'עיר',
        'חי',
        'צומח',
        'דומם',
        'ילד',
        'ילדה',
        'מאכל',
        'מקצוע',
        'אישיות',
]
    

table = {
    'א': {
        'ארץ': ['ארגנטינה','אורגוואי'],
        'עיר': ['אור עקיבה'],
        'חי': ['אריה', 'ארנב', 'אורנאוטנג'],
        'צומח': ['אורן','אורז'],
        'דומם': ['ארון'],
        'ילד': ['אורי'],
        'ילדה': ['אוריה','אלה'],
        'מאכל': ['אורז','אבטיח'],
        'מקצוע': ['ארכיטקט','אדריכל','אופטומטריסט'],
        'אישיות': ['אורנה פיטוסי','אורנה בנאי'],
        },
    'ב': {
        'ארץ': ['בולגריה'],
        'עיר': ['באר שבע'],
        'חי': ['ברבור'],
        'צומח': ['בוגונביליה'],
        'דומם': ['בית'],
        'ילד': ['בני'],
        'ילדה': ['בתיה'],
        'מאכל': ['במיה'],
        'מקצוע': ['בנאי'],
        'אישיות': ['בני סלע'],
        },
    'ג': {
        'ארץ': ['גאוטמלה'],
        'עיר': ['גבעת עדה'],
        'חי': ['גמל'],
        'צומח': ['גזר'],
        'דומם': ['גרב'],
        'ילד': ['גוני'],
        'ילדה': ['גילה'],
        'מאכל': ['גלידה'],
        'מקצוע': ['גנן'],
        'אישיות': ['גילה אלמגור'],
        },
    'ד': {
        'ארץ': ['דנמרק'],
        'עיר': ['דמשק'],
        'חי': ['דורבן'],
        'צומח': ['דולב'],
        'דומם': ['דלת'],
        'ילד': ['דני'],
        'ילדה': ['דינה'],
        'מאכל': ['דובדבן'],
        'מקצוע': ['דוור'],
        'אישיות': ['דון לני גבאי'],
        },
    'ה': {
        'ארץ': ['הולנד'],
        'עיר': ['הונלולו'],
        'חי': ['היפופוטם'],
        'צומח': ['הרדוף'],
        'דומם': ['הר'],
        'ילד': ['הארי'],
        'ילדה': ['הילה'],
        'מאכל': ['היביסקוס'],
        'מקצוע': ['הנדסאי תוכנה'],
        'אישיות': ['הארי סטיילס'],
        },
    'ו': {
        'ארץ': ['ויאטנם'],
        'עיר': ['וינה'],
        'חי': ['וולבי'],
        'צומח': ['ורד'],
        'דומם': ['וילון'],
        'ילד': ['ויקטור'],
        'ילדה': ['ויויאן'],
        'מאכל': ['וופל'],
        'מקצוע': ['וטרינר'],
        'אישיות': ['ויקטור תייר'],
        },
    'ז': {
        'ארץ': ['זמביה'],
        'עיר': ['זכרון יעקוב'],
        'חי': ['זחל'],
        'צומח': ['זיקית'],
        'דומם': ['זבל'],
        'ילד': ['זכריה'],
        'ילדה': ['זיווה'],
        'מאכל': ['זנגביל'],
        'מקצוע': ['זונה'],
        'אישיות': ['זאין מאליק'],
        },
    'ח': {
        'ארץ': ['חוף השנהב'],
        'עיר': ['חיפה'],
        'חי': ['חיפושית'],
        'צומח': ['חרוב'],
        'דומם': ['חרב'],
        'ילד': ['חן'],
        'ילדה': ['חנה'],
        'מאכל': ['חריימה'],
        'מקצוע': ['חמר'],
        'אישיות': ['חנן יובל'],
        },
    'ט': {
        'ארץ': ['טורקיה'],
        'עיר': ['טיבעון'],
        'חי': ['טווס'],
        'צומח': ['טימין'],
        'דומם': ['טלפון'],
        'ילד': ['טוביה'],
        'ילדה': ['טובה'],
        'מאכל': ['טימין'],
        'מקצוע': ['טבח'],
        'אישיות': ['טוביה צפיר'],
        },
    'י': {
        'ארץ': ['יוון'],
        'עיר': ['יפו'],
        'חי': ['יטוש'],
        'צומח': ['יקינטון'],
        'דומם': ['ילקוט'],
        'ילד': ['יוני'],
        'ילדה': ['יעל'],
        'מאכל': ['יוגורט'],
        'מקצוע': ['ימאי'],
        'אישיות': ['ישראל קטורזה'],
        },
    '': {
        'ארץ': [''],
        'עיר': [''],
        'חי': [''],
        'צומח': [''],
        'דומם': [''],
        'ילד': [''],
        'ילדה': [''],
        'מאכל': [''],
        'מקצוע': [''],
        'אישיות': [''],
        },
    '': {
        'ארץ': [''],
        'עיר': [''],
        'חי': [''],
        'צומח': [''],
        'דומם': [''],
        'ילד': [''],
        'ילדה': [''],
        'מאכל': [''],
        'מקצוע': [''],
        'אישיות': [''],
        },
    '': {
        'ארץ': [''],
        'עיר': [''],
        'חי': [''],
        'צומח': [''],
        'דומם': [''],
        'ילד': [''],
        'ילדה': [''],
        'מאכל': [''],
        'מקצוע': [''],
        'אישיות': [''],
        },

}

def flip(s):
    r = ''
    for x in s:
        r = x + r
    return r 

while(True):
    c = input('תוא רחב  ')
    answer = table[c]
    for f in topic_order:
        print(flip(f),end = ': ')
        for x in answer[f]:
            print(flip(x),end = ', ')
        print()

        
